ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tc.h
/*
 * Component description for TC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-25T06:52:33Z */
#ifndef _SAMD21_TC_COMPONENT_H_
#define _SAMD21_TC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR TC                                           */
/* ************************************************************************** */

/* -------- TC_CTRLA : (TC Offset: 0x00) (R/W 16) Control A -------- */
#define TC_CTRLA_RESETVALUE _UINT16_(0x00) /*  (TC_CTRLA) Control A  Reset Value */

#define TC_CTRLA_SWRST_Pos _UINT16_(0) /* (TC_CTRLA) Software Reset Position */
#define TC_CTRLA_SWRST_Msk (_UINT16_(0x1) << TC_CTRLA_SWRST_Pos) /* (TC_CTRLA) Software Reset Mask */
#define TC_CTRLA_SWRST(value)                                                                                          \
        (TC_CTRLA_SWRST_Msk &                                                                                          \
         (_UINT16_(value) << TC_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the TC_CTRLA register */
#define TC_CTRLA_ENABLE_Pos _UINT16_(1) /* (TC_CTRLA) Enable Position */
#define TC_CTRLA_ENABLE_Msk (_UINT16_(0x1) << TC_CTRLA_ENABLE_Pos) /* (TC_CTRLA) Enable Mask */
#define TC_CTRLA_ENABLE(value)                                                                                         \
        (TC_CTRLA_ENABLE_Msk &                                                                                         \
         (_UINT16_(value) << TC_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the TC_CTRLA register */
#define TC_CTRLA_MODE_Pos _UINT16_(2) /* (TC_CTRLA) TC Mode Position */
#define TC_CTRLA_MODE_Msk (_UINT16_(0x3) << TC_CTRLA_MODE_Pos) /* (TC_CTRLA) TC Mode Mask */
#define TC_CTRLA_MODE(value)                                                                                           \
        (TC_CTRLA_MODE_Msk &                                                                                           \
         (_UINT16_(value) << TC_CTRLA_MODE_Pos)) /* Assigment of value for MODE in the TC_CTRLA register */
#define TC_CTRLA_MODE_COUNT16_Val _UINT16_(0x0) /* (TC_CTRLA) Counter in 16-bit mode  */
#define TC_CTRLA_MODE_COUNT8_Val _UINT16_(0x1) /* (TC_CTRLA) Counter in 8-bit mode  */
#define TC_CTRLA_MODE_COUNT32_Val _UINT16_(0x2) /* (TC_CTRLA) Counter in 32-bit mode  */
#define TC_CTRLA_MODE_COUNT16                                                                                          \
        (TC_CTRLA_MODE_COUNT16_Val << TC_CTRLA_MODE_Pos) /* (TC_CTRLA) Counter in 16-bit mode Position  */
#define TC_CTRLA_MODE_COUNT8                                                                                           \
        (TC_CTRLA_MODE_COUNT8_Val << TC_CTRLA_MODE_Pos) /* (TC_CTRLA) Counter in 8-bit mode Position  */
#define TC_CTRLA_MODE_COUNT32                                                                                          \
        (TC_CTRLA_MODE_COUNT32_Val << TC_CTRLA_MODE_Pos) /* (TC_CTRLA) Counter in 32-bit mode Position  */
#define TC_CTRLA_WAVEGEN_Pos _UINT16_(5) /* (TC_CTRLA) Waveform Generation Operation Position */
#define TC_CTRLA_WAVEGEN_Msk (_UINT16_(0x3) << TC_CTRLA_WAVEGEN_Pos) /* (TC_CTRLA) Waveform Generation Operation Mask  \
                                                                      */
#define TC_CTRLA_WAVEGEN(value)                                                                                        \
        (TC_CTRLA_WAVEGEN_Msk &                                                                                        \
         (_UINT16_(value) << TC_CTRLA_WAVEGEN_Pos)) /* Assigment of value for WAVEGEN in the TC_CTRLA register */
#define TC_CTRLA_WAVEGEN_NFRQ_Val _UINT16_(0x0) /* (TC_CTRLA)   */
#define TC_CTRLA_WAVEGEN_MFRQ_Val _UINT16_(0x1) /* (TC_CTRLA)   */
#define TC_CTRLA_WAVEGEN_NPWM_Val _UINT16_(0x2) /* (TC_CTRLA)   */
#define TC_CTRLA_WAVEGEN_MPWM_Val _UINT16_(0x3) /* (TC_CTRLA)   */
#define TC_CTRLA_WAVEGEN_NFRQ (TC_CTRLA_WAVEGEN_NFRQ_Val << TC_CTRLA_WAVEGEN_Pos) /* (TC_CTRLA)  Position  */
#define TC_CTRLA_WAVEGEN_MFRQ (TC_CTRLA_WAVEGEN_MFRQ_Val << TC_CTRLA_WAVEGEN_Pos) /* (TC_CTRLA)  Position  */
#define TC_CTRLA_WAVEGEN_NPWM (TC_CTRLA_WAVEGEN_NPWM_Val << TC_CTRLA_WAVEGEN_Pos) /* (TC_CTRLA)  Position  */
#define TC_CTRLA_WAVEGEN_MPWM (TC_CTRLA_WAVEGEN_MPWM_Val << TC_CTRLA_WAVEGEN_Pos) /* (TC_CTRLA)  Position  */
#define TC_CTRLA_PRESCALER_Pos _UINT16_(8) /* (TC_CTRLA) Prescaler Position */
#define TC_CTRLA_PRESCALER_Msk (_UINT16_(0x7) << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) Prescaler Mask */
#define TC_CTRLA_PRESCALER(value)                                                                                      \
        (TC_CTRLA_PRESCALER_Msk &                                                                                      \
         (_UINT16_(value) << TC_CTRLA_PRESCALER_Pos)) /* Assigment of value for PRESCALER in the TC_CTRLA register */
#define TC_CTRLA_PRESCALER_DIV1_Val _UINT16_(0x0) /* (TC_CTRLA) Prescaler: GCLK_TC  */
#define TC_CTRLA_PRESCALER_DIV2_Val _UINT16_(0x1) /* (TC_CTRLA) Prescaler: GCLK_TC/2  */
#define TC_CTRLA_PRESCALER_DIV4_Val _UINT16_(0x2) /* (TC_CTRLA) Prescaler: GCLK_TC/4  */
#define TC_CTRLA_PRESCALER_DIV8_Val _UINT16_(0x3) /* (TC_CTRLA) Prescaler: GCLK_TC/8  */
#define TC_CTRLA_PRESCALER_DIV16_Val _UINT16_(0x4) /* (TC_CTRLA) Prescaler: GCLK_TC/16  */
#define TC_CTRLA_PRESCALER_DIV64_Val _UINT16_(0x5) /* (TC_CTRLA) Prescaler: GCLK_TC/64  */
#define TC_CTRLA_PRESCALER_DIV256_Val _UINT16_(0x6) /* (TC_CTRLA) Prescaler: GCLK_TC/256  */
#define TC_CTRLA_PRESCALER_DIV1024_Val _UINT16_(0x7) /* (TC_CTRLA) Prescaler: GCLK_TC/1024  */
#define TC_CTRLA_PRESCALER_DIV1                                                                                        \
        (TC_CTRLA_PRESCALER_DIV1_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) Prescaler: GCLK_TC Position  */
#define TC_CTRLA_PRESCALER_DIV2                                                                                        \
        (TC_CTRLA_PRESCALER_DIV2_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) Prescaler: GCLK_TC/2 Position  */
#define TC_CTRLA_PRESCALER_DIV4                                                                                        \
        (TC_CTRLA_PRESCALER_DIV4_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) Prescaler: GCLK_TC/4 Position  */
#define TC_CTRLA_PRESCALER_DIV8                                                                                        \
        (TC_CTRLA_PRESCALER_DIV8_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) Prescaler: GCLK_TC/8 Position  */
#define TC_CTRLA_PRESCALER_DIV16                                                                                       \
        (TC_CTRLA_PRESCALER_DIV16_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) Prescaler: GCLK_TC/16 Position  */
#define TC_CTRLA_PRESCALER_DIV64                                                                                       \
        (TC_CTRLA_PRESCALER_DIV64_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) Prescaler: GCLK_TC/64 Position  */
#define TC_CTRLA_PRESCALER_DIV256                                                                                      \
        (TC_CTRLA_PRESCALER_DIV256_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) Prescaler: GCLK_TC/256 Position  */
#define TC_CTRLA_PRESCALER_DIV1024                                                                                     \
        (TC_CTRLA_PRESCALER_DIV1024_Val << TC_CTRLA_PRESCALER_Pos) /* (TC_CTRLA) Prescaler: GCLK_TC/1024 Position  */
#define TC_CTRLA_RUNSTDBY_Pos _UINT16_(11) /* (TC_CTRLA) Run in Standby Position */
#define TC_CTRLA_RUNSTDBY_Msk (_UINT16_(0x1) << TC_CTRLA_RUNSTDBY_Pos) /* (TC_CTRLA) Run in Standby Mask */
#define TC_CTRLA_RUNSTDBY(value)                                                                                       \
        (TC_CTRLA_RUNSTDBY_Msk &                                                                                       \
         (_UINT16_(value) << TC_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the TC_CTRLA register */
#define TC_CTRLA_PRESCSYNC_Pos _UINT16_(12) /* (TC_CTRLA) Prescaler and Counter Synchronization Position */
#define TC_CTRLA_PRESCSYNC_Msk                                                                                         \
        (_UINT16_(0x3) << TC_CTRLA_PRESCSYNC_Pos) /* (TC_CTRLA) Prescaler and Counter Synchronization Mask */
#define TC_CTRLA_PRESCSYNC(value)                                                                                      \
        (TC_CTRLA_PRESCSYNC_Msk &                                                                                      \
         (_UINT16_(value) << TC_CTRLA_PRESCSYNC_Pos)) /* Assigment of value for PRESCSYNC in the TC_CTRLA register */
#define TC_CTRLA_PRESCSYNC_GCLK_Val _UINT16_(0x0) /* (TC_CTRLA) Reload or reset the counter on next generic clock  */
#define TC_CTRLA_PRESCSYNC_PRESC_Val _UINT16_(0x1) /* (TC_CTRLA) Reload or reset the counter on next prescaler clock   \
                                                    */
#define TC_CTRLA_PRESCSYNC_RESYNC_Val                                                                                  \
        _UINT16_(0x2) /* (TC_CTRLA) Reload or reset the counter on next generic clock. Reset the prescaler counter  */
#define TC_CTRLA_PRESCSYNC_GCLK                                                                                        \
        (                                                                                                              \
                TC_CTRLA_PRESCSYNC_GCLK_Val                                                                            \
                << TC_CTRLA_PRESCSYNC_Pos) /* (TC_CTRLA) Reload or reset the counter on next generic clock Position */
#define TC_CTRLA_PRESCSYNC_PRESC                                                                                       \
        (TC_CTRLA_PRESCSYNC_PRESC_Val                                                                                  \
         << TC_CTRLA_PRESCSYNC_Pos) /* (TC_CTRLA) Reload or reset the counter on next prescaler clock Position  */
#define TC_CTRLA_PRESCSYNC_RESYNC                                                                                      \
        (                                                                                                              \
                TC_CTRLA_PRESCSYNC_RESYNC_Val                                                                          \
                << TC_CTRLA_PRESCSYNC_Pos) /* (TC_CTRLA) Reload or reset the counter on next generic clock. Reset the  \
                                              prescaler counter Position  */
#define TC_CTRLA_Msk _UINT16_(0x3F6F) /* (TC_CTRLA) Register Mask  */


/* -------- TC_READREQ : (TC Offset: 0x02) (R/W 16) Read Request -------- */
#define TC_READREQ_RESETVALUE _UINT16_(0x00) /*  (TC_READREQ) Read Request  Reset Value */

