ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tc.h
#define TC_READREQ_ADDR_Pos _UINT16_(0) /* (TC_READREQ) Address Position */
#define TC_READREQ_ADDR_Msk (_UINT16_(0x1F) << TC_READREQ_ADDR_Pos) /* (TC_READREQ) Address Mask */
#define TC_READREQ_ADDR(value)                                                                                         \
        (TC_READREQ_ADDR_Msk &                                                                                         \
         (_UINT16_(value) << TC_READREQ_ADDR_Pos)) /* Assigment of value for ADDR in the TC_READREQ register */
#define TC_READREQ_RCONT_Pos _UINT16_(14) /* (TC_READREQ) Read Continuously Position */
#define TC_READREQ_RCONT_Msk (_UINT16_(0x1) << TC_READREQ_RCONT_Pos) /* (TC_READREQ) Read Continuously Mask */
#define TC_READREQ_RCONT(value)                                                                                        \
        (TC_READREQ_RCONT_Msk &                                                                                        \
         (_UINT16_(value) << TC_READREQ_RCONT_Pos)) /* Assigment of value for RCONT in the TC_READREQ register */
#define TC_READREQ_RREQ_Pos _UINT16_(15) /* (TC_READREQ) Read Request Position */
#define TC_READREQ_RREQ_Msk (_UINT16_(0x1) << TC_READREQ_RREQ_Pos) /* (TC_READREQ) Read Request Mask */
#define TC_READREQ_RREQ(value)                                                                                         \
        (TC_READREQ_RREQ_Msk &                                                                                         \
         (_UINT16_(value) << TC_READREQ_RREQ_Pos)) /* Assigment of value for RREQ in the TC_READREQ register */
#define TC_READREQ_Msk _UINT16_(0xC01F) /* (TC_READREQ) Register Mask  */


/* -------- TC_CTRLBCLR : (TC Offset: 0x04) (R/W 8) Control B Clear -------- */
#define TC_CTRLBCLR_RESETVALUE _UINT8_(0x02) /*  (TC_CTRLBCLR) Control B Clear  Reset Value */

#define TC_CTRLBCLR_DIR_Pos _UINT8_(0) /* (TC_CTRLBCLR) Counter Direction Position */
#define TC_CTRLBCLR_DIR_Msk (_UINT8_(0x1) << TC_CTRLBCLR_DIR_Pos) /* (TC_CTRLBCLR) Counter Direction Mask */
#define TC_CTRLBCLR_DIR(value)                                                                                         \
        (TC_CTRLBCLR_DIR_Msk &                                                                                         \
         (_UINT8_(value) << TC_CTRLBCLR_DIR_Pos)) /* Assigment of value for DIR in the TC_CTRLBCLR register */
#define TC_CTRLBCLR_ONESHOT_Pos _UINT8_(2) /* (TC_CTRLBCLR) One-Shot Position */
#define TC_CTRLBCLR_ONESHOT_Msk (_UINT8_(0x1) << TC_CTRLBCLR_ONESHOT_Pos) /* (TC_CTRLBCLR) One-Shot Mask */
#define TC_CTRLBCLR_ONESHOT(value)                                                                                     \
        (TC_CTRLBCLR_ONESHOT_Msk &                                                                                     \
         (_UINT8_(value) << TC_CTRLBCLR_ONESHOT_Pos)) /* Assigment of value for ONESHOT in the TC_CTRLBCLR register */
#define TC_CTRLBCLR_CMD_Pos _UINT8_(6) /* (TC_CTRLBCLR) Command Position */
#define TC_CTRLBCLR_CMD_Msk (_UINT8_(0x3) << TC_CTRLBCLR_CMD_Pos) /* (TC_CTRLBCLR) Command Mask */
#define TC_CTRLBCLR_CMD(value)                                                                                         \
        (TC_CTRLBCLR_CMD_Msk &                                                                                         \
         (_UINT8_(value) << TC_CTRLBCLR_CMD_Pos)) /* Assigment of value for CMD in the TC_CTRLBCLR register */
#define TC_CTRLBCLR_CMD_NONE_Val _UINT8_(0x0) /* (TC_CTRLBCLR) No action  */
#define TC_CTRLBCLR_CMD_RETRIGGER_Val _UINT8_(0x1) /* (TC_CTRLBCLR) Force a start, restart or retrigger  */
#define TC_CTRLBCLR_CMD_STOP_Val _UINT8_(0x2) /* (TC_CTRLBCLR) Force a stop  */
#define TC_CTRLBCLR_CMD_NONE (TC_CTRLBCLR_CMD_NONE_Val << TC_CTRLBCLR_CMD_Pos) /* (TC_CTRLBCLR) No action Position  */
#define TC_CTRLBCLR_CMD_RETRIGGER                                                                                      \
        (                                                                                                              \
                TC_CTRLBCLR_CMD_RETRIGGER_Val                                                                          \
                << TC_CTRLBCLR_CMD_Pos) /* (TC_CTRLBCLR) Force a start, restart or retrigger Position  */
#define TC_CTRLBCLR_CMD_STOP                                                                                           \
        (TC_CTRLBCLR_CMD_STOP_Val << TC_CTRLBCLR_CMD_Pos) /* (TC_CTRLBCLR) Force a stop Position  */
#define TC_CTRLBCLR_Msk _UINT8_(0xC5) /* (TC_CTRLBCLR) Register Mask  */


/* -------- TC_CTRLBSET : (TC Offset: 0x05) (R/W 8) Control B Set -------- */
#define TC_CTRLBSET_RESETVALUE _UINT8_(0x00) /*  (TC_CTRLBSET) Control B Set  Reset Value */

#define TC_CTRLBSET_DIR_Pos _UINT8_(0) /* (TC_CTRLBSET) Counter Direction Position */
#define TC_CTRLBSET_DIR_Msk (_UINT8_(0x1) << TC_CTRLBSET_DIR_Pos) /* (TC_CTRLBSET) Counter Direction Mask */
#define TC_CTRLBSET_DIR(value)                                                                                         \
        (TC_CTRLBSET_DIR_Msk &                                                                                         \
         (_UINT8_(value) << TC_CTRLBSET_DIR_Pos)) /* Assigment of value for DIR in the TC_CTRLBSET register */
#define TC_CTRLBSET_ONESHOT_Pos _UINT8_(2) /* (TC_CTRLBSET) One-Shot Position */
#define TC_CTRLBSET_ONESHOT_Msk (_UINT8_(0x1) << TC_CTRLBSET_ONESHOT_Pos) /* (TC_CTRLBSET) One-Shot Mask */
#define TC_CTRLBSET_ONESHOT(value)                                                                                     \
        (TC_CTRLBSET_ONESHOT_Msk &                                                                                     \
         (_UINT8_(value) << TC_CTRLBSET_ONESHOT_Pos)) /* Assigment of value for ONESHOT in the TC_CTRLBSET register */
#define TC_CTRLBSET_CMD_Pos _UINT8_(6) /* (TC_CTRLBSET) Command Position */
#define TC_CTRLBSET_CMD_Msk (_UINT8_(0x3) << TC_CTRLBSET_CMD_Pos) /* (TC_CTRLBSET) Command Mask */
#define TC_CTRLBSET_CMD(value)                                                                                         \
        (TC_CTRLBSET_CMD_Msk &                                                                                         \
         (_UINT8_(value) << TC_CTRLBSET_CMD_Pos)) /* Assigment of value for CMD in the TC_CTRLBSET register */
#define TC_CTRLBSET_CMD_NONE_Val _UINT8_(0x0) /* (TC_CTRLBSET) No action  */
#define TC_CTRLBSET_CMD_RETRIGGER_Val _UINT8_(0x1) /* (TC_CTRLBSET) Force a start, restart or retrigger  */
#define TC_CTRLBSET_CMD_STOP_Val _UINT8_(0x2) /* (TC_CTRLBSET) Force a stop  */
#define TC_CTRLBSET_CMD_NONE (TC_CTRLBSET_CMD_NONE_Val << TC_CTRLBSET_CMD_Pos) /* (TC_CTRLBSET) No action Position  */
#define TC_CTRLBSET_CMD_RETRIGGER                                                                                      \
        (                                                                                                              \
                TC_CTRLBSET_CMD_RETRIGGER_Val                                                                          \
                << TC_CTRLBSET_CMD_Pos) /* (TC_CTRLBSET) Force a start, restart or retrigger Position  */
#define TC_CTRLBSET_CMD_STOP                                                                                           \
        (TC_CTRLBSET_CMD_STOP_Val << TC_CTRLBSET_CMD_Pos) /* (TC_CTRLBSET) Force a stop Position  */
#define TC_CTRLBSET_Msk _UINT8_(0xC5) /* (TC_CTRLBSET) Register Mask  */


/* -------- TC_CTRLC : (TC Offset: 0x06) (R/W 8) Control C -------- */
#define TC_CTRLC_RESETVALUE _UINT8_(0x00) /*  (TC_CTRLC) Control C  Reset Value */

#define TC_CTRLC_INVEN0_Pos _UINT8_(0) /* (TC_CTRLC) Output Waveform 0 Invert Enable Position */
#define TC_CTRLC_INVEN0_Msk (_UINT8_(0x1) << TC_CTRLC_INVEN0_Pos) /* (TC_CTRLC) Output Waveform 0 Invert Enable Mask   \
                                                                   */
#define TC_CTRLC_INVEN0(value)                                                                                         \
        (TC_CTRLC_INVEN0_Msk &                                                                                         \
         (_UINT8_(value) << TC_CTRLC_INVEN0_Pos)) /* Assigment of value for INVEN0 in the TC_CTRLC register */
#define TC_CTRLC_INVEN1_Pos _UINT8_(1) /* (TC_CTRLC) Output Waveform 1 Invert Enable Position */
#define TC_CTRLC_INVEN1_Msk (_UINT8_(0x1) << TC_CTRLC_INVEN1_Pos) /* (TC_CTRLC) Output Waveform 1 Invert Enable Mask   \
                                                                   */
#define TC_CTRLC_INVEN1(value)                                                                                         \
        (TC_CTRLC_INVEN1_Msk &                                                                                         \
         (_UINT8_(value) << TC_CTRLC_INVEN1_Pos)) /* Assigment of value for INVEN1 in the TC_CTRLC register */
#define TC_CTRLC_CPTEN0_Pos _UINT8_(4) /* (TC_CTRLC) Capture Channel 0 Enable Position */
#define TC_CTRLC_CPTEN0_Msk (_UINT8_(0x1) << TC_CTRLC_CPTEN0_Pos) /* (TC_CTRLC) Capture Channel 0 Enable Mask */
#define TC_CTRLC_CPTEN0(value)                                                                                         \
        (TC_CTRLC_CPTEN0_Msk &                                                                                         \
         (_UINT8_(value) << TC_CTRLC_CPTEN0_Pos)) /* Assigment of value for CPTEN0 in the TC_CTRLC register */
#define TC_CTRLC_CPTEN1_Pos _UINT8_(5) /* (TC_CTRLC) Capture Channel 1 Enable Position */
#define TC_CTRLC_CPTEN1_Msk (_UINT8_(0x1) << TC_CTRLC_CPTEN1_Pos) /* (TC_CTRLC) Capture Channel 1 Enable Mask */
#define TC_CTRLC_CPTEN1(value)                                                                                         \
        (TC_CTRLC_CPTEN1_Msk &                                                                                         \
         (_UINT8_(value) << TC_CTRLC_CPTEN1_Pos)) /* Assigment of value for CPTEN1 in the TC_CTRLC register */
#define TC_CTRLC_Msk _UINT8_(0x33) /* (TC_CTRLC) Register Mask  */

#define TC_CTRLC_INVEN_Pos _UINT8_(0) /* (TC_CTRLC Position) Output Waveform x Invert Enable */
#define TC_CTRLC_INVEN_Msk (_UINT8_(0x3) << TC_CTRLC_INVEN_Pos) /* (TC_CTRLC Mask) INVEN */
#define TC_CTRLC_INVEN(value) (TC_CTRLC_INVEN_Msk & (_UINT8_(value) << TC_CTRLC_INVEN_Pos))
#define TC_CTRLC_CPTEN_Pos _UINT8_(4) /* (TC_CTRLC Position) Capture Channel x Enable */
#define TC_CTRLC_CPTEN_Msk (_UINT8_(0x3) << TC_CTRLC_CPTEN_Pos) /* (TC_CTRLC Mask) CPTEN */
#define TC_CTRLC_CPTEN(value) (TC_CTRLC_CPTEN_Msk & (_UINT8_(value) << TC_CTRLC_CPTEN_Pos))

/* -------- TC_DBGCTRL : (TC Offset: 0x08) (R/W 8) Debug Control -------- */
#define TC_DBGCTRL_RESETVALUE _UINT8_(0x00) /*  (TC_DBGCTRL) Debug Control  Reset Value */

