ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tc.h
#define TC_DBGCTRL_DBGRUN_Pos _UINT8_(0) /* (TC_DBGCTRL) Debug Run Mode Position */
#define TC_DBGCTRL_DBGRUN_Msk (_UINT8_(0x1) << TC_DBGCTRL_DBGRUN_Pos) /* (TC_DBGCTRL) Debug Run Mode Mask */
#define TC_DBGCTRL_DBGRUN(value)                                                                                       \
        (TC_DBGCTRL_DBGRUN_Msk &                                                                                       \
         (_UINT8_(value) << TC_DBGCTRL_DBGRUN_Pos)) /* Assigment of value for DBGRUN in the TC_DBGCTRL register */
#define TC_DBGCTRL_Msk _UINT8_(0x01) /* (TC_DBGCTRL) Register Mask  */


/* -------- TC_EVCTRL : (TC Offset: 0x0A) (R/W 16) Event Control -------- */
#define TC_EVCTRL_RESETVALUE _UINT16_(0x00) /*  (TC_EVCTRL) Event Control  Reset Value */

#define TC_EVCTRL_EVACT_Pos _UINT16_(0) /* (TC_EVCTRL) Event Action Position */
#define TC_EVCTRL_EVACT_Msk (_UINT16_(0x7) << TC_EVCTRL_EVACT_Pos) /* (TC_EVCTRL) Event Action Mask */
#define TC_EVCTRL_EVACT(value)                                                                                         \
        (TC_EVCTRL_EVACT_Msk &                                                                                         \
         (_UINT16_(value) << TC_EVCTRL_EVACT_Pos)) /* Assigment of value for EVACT in the TC_EVCTRL register */
#define TC_EVCTRL_EVACT_OFF_Val _UINT16_(0x0) /* (TC_EVCTRL) Event action disabled  */
#define TC_EVCTRL_EVACT_RETRIGGER_Val _UINT16_(0x1) /* (TC_EVCTRL) Start, restart or retrigger TC on event  */
#define TC_EVCTRL_EVACT_COUNT_Val _UINT16_(0x2) /* (TC_EVCTRL) Count on event  */
#define TC_EVCTRL_EVACT_START_Val _UINT16_(0x3) /* (TC_EVCTRL) Start TC on event  */
#define TC_EVCTRL_EVACT_PPW_Val _UINT16_(0x5) /* (TC_EVCTRL) Period captured in CC0, pulse width in CC1  */
#define TC_EVCTRL_EVACT_PWP_Val _UINT16_(0x6) /* (TC_EVCTRL) Period captured in CC1, pulse width in CC0  */
#define TC_EVCTRL_EVACT_OFF                                                                                            \
        (TC_EVCTRL_EVACT_OFF_Val << TC_EVCTRL_EVACT_Pos) /* (TC_EVCTRL) Event action disabled Position  */
#define TC_EVCTRL_EVACT_RETRIGGER                                                                                      \
        (                                                                                                              \
                TC_EVCTRL_EVACT_RETRIGGER_Val                                                                          \
                << TC_EVCTRL_EVACT_Pos) /* (TC_EVCTRL) Start, restart or retrigger TC on event Position  */
#define TC_EVCTRL_EVACT_COUNT                                                                                          \
        (TC_EVCTRL_EVACT_COUNT_Val << TC_EVCTRL_EVACT_Pos) /* (TC_EVCTRL) Count on event Position  */
#define TC_EVCTRL_EVACT_START                                                                                          \
        (TC_EVCTRL_EVACT_START_Val << TC_EVCTRL_EVACT_Pos) /* (TC_EVCTRL) Start TC on event Position  */
#define TC_EVCTRL_EVACT_PPW                                                                                            \
        (TC_EVCTRL_EVACT_PPW_Val                                                                                       \
         << TC_EVCTRL_EVACT_Pos) /* (TC_EVCTRL) Period captured in CC0, pulse width in CC1 Position  */
#define TC_EVCTRL_EVACT_PWP                                                                                            \
        (TC_EVCTRL_EVACT_PWP_Val                                                                                       \
         << TC_EVCTRL_EVACT_Pos) /* (TC_EVCTRL) Period captured in CC1, pulse width in CC0 Position  */
#define TC_EVCTRL_TCINV_Pos _UINT16_(4) /* (TC_EVCTRL) TC Inverted Event Input Position */
#define TC_EVCTRL_TCINV_Msk (_UINT16_(0x1) << TC_EVCTRL_TCINV_Pos) /* (TC_EVCTRL) TC Inverted Event Input Mask */
#define TC_EVCTRL_TCINV(value)                                                                                         \
        (TC_EVCTRL_TCINV_Msk &                                                                                         \
         (_UINT16_(value) << TC_EVCTRL_TCINV_Pos)) /* Assigment of value for TCINV in the TC_EVCTRL register */
#define TC_EVCTRL_TCEI_Pos _UINT16_(5) /* (TC_EVCTRL) TC Event Input Position */
#define TC_EVCTRL_TCEI_Msk (_UINT16_(0x1) << TC_EVCTRL_TCEI_Pos) /* (TC_EVCTRL) TC Event Input Mask */
#define TC_EVCTRL_TCEI(value)                                                                                          \
        (TC_EVCTRL_TCEI_Msk &                                                                                          \
         (_UINT16_(value) << TC_EVCTRL_TCEI_Pos)) /* Assigment of value for TCEI in the TC_EVCTRL register */
#define TC_EVCTRL_OVFEO_Pos _UINT16_(8) /* (TC_EVCTRL) Overflow/Underflow Event Output Enable Position */
#define TC_EVCTRL_OVFEO_Msk                                                                                            \
        (_UINT16_(0x1) << TC_EVCTRL_OVFEO_Pos) /* (TC_EVCTRL) Overflow/Underflow Event Output Enable Mask */
#define TC_EVCTRL_OVFEO(value)                                                                                         \
        (TC_EVCTRL_OVFEO_Msk &                                                                                         \
         (_UINT16_(value) << TC_EVCTRL_OVFEO_Pos)) /* Assigment of value for OVFEO in the TC_EVCTRL register */
#define TC_EVCTRL_MCEO0_Pos _UINT16_(12) /* (TC_EVCTRL) Match or Capture Channel 0 Event Output Enable Position */
#define TC_EVCTRL_MCEO0_Msk                                                                                            \
        (_UINT16_(0x1) << TC_EVCTRL_MCEO0_Pos) /* (TC_EVCTRL) Match or Capture Channel 0 Event Output Enable Mask */
#define TC_EVCTRL_MCEO0(value)                                                                                         \
        (TC_EVCTRL_MCEO0_Msk &                                                                                         \
         (_UINT16_(value) << TC_EVCTRL_MCEO0_Pos)) /* Assigment of value for MCEO0 in the TC_EVCTRL register */
#define TC_EVCTRL_MCEO1_Pos _UINT16_(13) /* (TC_EVCTRL) Match or Capture Channel 1 Event Output Enable Position */
#define TC_EVCTRL_MCEO1_Msk                                                                                            \
        (_UINT16_(0x1) << TC_EVCTRL_MCEO1_Pos) /* (TC_EVCTRL) Match or Capture Channel 1 Event Output Enable Mask */
#define TC_EVCTRL_MCEO1(value)                                                                                         \
        (TC_EVCTRL_MCEO1_Msk &                                                                                         \
         (_UINT16_(value) << TC_EVCTRL_MCEO1_Pos)) /* Assigment of value for MCEO1 in the TC_EVCTRL register */
#define TC_EVCTRL_Msk _UINT16_(0x3137) /* (TC_EVCTRL) Register Mask  */

#define TC_EVCTRL_MCEO_Pos _UINT16_(12) /* (TC_EVCTRL Position) Match or Capture Channel x Event Output Enable */
#define TC_EVCTRL_MCEO_Msk (_UINT16_(0x3) << TC_EVCTRL_MCEO_Pos) /* (TC_EVCTRL Mask) MCEO */
#define TC_EVCTRL_MCEO(value) (TC_EVCTRL_MCEO_Msk & (_UINT16_(value) << TC_EVCTRL_MCEO_Pos))

/* -------- TC_INTENCLR : (TC Offset: 0x0C) (R/W 8) Interrupt Enable Clear -------- */
#define TC_INTENCLR_RESETVALUE _UINT8_(0x00) /*  (TC_INTENCLR) Interrupt Enable Clear  Reset Value */

#define TC_INTENCLR_OVF_Pos _UINT8_(0) /* (TC_INTENCLR) Overflow Interrupt Enable Position */
#define TC_INTENCLR_OVF_Msk (_UINT8_(0x1) << TC_INTENCLR_OVF_Pos) /* (TC_INTENCLR) Overflow Interrupt Enable Mask */
#define TC_INTENCLR_OVF(value)                                                                                         \
        (TC_INTENCLR_OVF_Msk &                                                                                         \
         (_UINT8_(value) << TC_INTENCLR_OVF_Pos)) /* Assigment of value for OVF in the TC_INTENCLR register */
#define TC_INTENCLR_ERR_Pos _UINT8_(1) /* (TC_INTENCLR) Error Interrupt Enable Position */
#define TC_INTENCLR_ERR_Msk (_UINT8_(0x1) << TC_INTENCLR_ERR_Pos) /* (TC_INTENCLR) Error Interrupt Enable Mask */
#define TC_INTENCLR_ERR(value)                                                                                         \
        (TC_INTENCLR_ERR_Msk &                                                                                         \
         (_UINT8_(value) << TC_INTENCLR_ERR_Pos)) /* Assigment of value for ERR in the TC_INTENCLR register */
#define TC_INTENCLR_SYNCRDY_Pos _UINT8_(3) /* (TC_INTENCLR) Synchronization Ready Interrupt Enable Position */
#define TC_INTENCLR_SYNCRDY_Msk                                                                                        \
        (_UINT8_(0x1) << TC_INTENCLR_SYNCRDY_Pos) /* (TC_INTENCLR) Synchronization Ready Interrupt Enable Mask */
#define TC_INTENCLR_SYNCRDY(value)                                                                                     \
        (TC_INTENCLR_SYNCRDY_Msk &                                                                                     \
         (_UINT8_(value) << TC_INTENCLR_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the TC_INTENCLR register */
#define TC_INTENCLR_MC0_Pos _UINT8_(4) /* (TC_INTENCLR) Match or Capture Channel 0 Interrupt Enable Position */
#define TC_INTENCLR_MC0_Msk                                                                                            \
        (_UINT8_(0x1) << TC_INTENCLR_MC0_Pos) /* (TC_INTENCLR) Match or Capture Channel 0 Interrupt Enable Mask */
#define TC_INTENCLR_MC0(value)                                                                                         \
        (TC_INTENCLR_MC0_Msk &                                                                                         \
         (_UINT8_(value) << TC_INTENCLR_MC0_Pos)) /* Assigment of value for MC0 in the TC_INTENCLR register */
#define TC_INTENCLR_MC1_Pos _UINT8_(5) /* (TC_INTENCLR) Match or Capture Channel 1 Interrupt Enable Position */
#define TC_INTENCLR_MC1_Msk                                                                                            \
        (_UINT8_(0x1) << TC_INTENCLR_MC1_Pos) /* (TC_INTENCLR) Match or Capture Channel 1 Interrupt Enable Mask */
#define TC_INTENCLR_MC1(value)                                                                                         \
        (TC_INTENCLR_MC1_Msk &                                                                                         \
         (_UINT8_(value) << TC_INTENCLR_MC1_Pos)) /* Assigment of value for MC1 in the TC_INTENCLR register */
#define TC_INTENCLR_Msk _UINT8_(0x3B) /* (TC_INTENCLR) Register Mask  */

#define TC_INTENCLR_MC_Pos _UINT8_(4) /* (TC_INTENCLR Position) Match or Capture Channel x Interrupt Enable */
#define TC_INTENCLR_MC_Msk (_UINT8_(0x3) << TC_INTENCLR_MC_Pos) /* (TC_INTENCLR Mask) MC */
#define TC_INTENCLR_MC(value) (TC_INTENCLR_MC_Msk & (_UINT8_(value) << TC_INTENCLR_MC_Pos))

