ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tc.h
/* -------- TC_INTENSET : (TC Offset: 0x0D) (R/W 8) Interrupt Enable Set -------- */
#define TC_INTENSET_RESETVALUE _UINT8_(0x00) /*  (TC_INTENSET) Interrupt Enable Set  Reset Value */

#define TC_INTENSET_OVF_Pos _UINT8_(0) /* (TC_INTENSET) Overflow Interrupt Enable Position */
#define TC_INTENSET_OVF_Msk (_UINT8_(0x1) << TC_INTENSET_OVF_Pos) /* (TC_INTENSET) Overflow Interrupt Enable Mask */
#define TC_INTENSET_OVF(value)                                                                                         \
        (TC_INTENSET_OVF_Msk &                                                                                         \
         (_UINT8_(value) << TC_INTENSET_OVF_Pos)) /* Assigment of value for OVF in the TC_INTENSET register */
#define TC_INTENSET_ERR_Pos _UINT8_(1) /* (TC_INTENSET) Error Interrupt Enable Position */
#define TC_INTENSET_ERR_Msk (_UINT8_(0x1) << TC_INTENSET_ERR_Pos) /* (TC_INTENSET) Error Interrupt Enable Mask */
#define TC_INTENSET_ERR(value)                                                                                         \
        (TC_INTENSET_ERR_Msk &                                                                                         \
         (_UINT8_(value) << TC_INTENSET_ERR_Pos)) /* Assigment of value for ERR in the TC_INTENSET register */
#define TC_INTENSET_SYNCRDY_Pos _UINT8_(3) /* (TC_INTENSET) Synchronization Ready Interrupt Enable Position */
#define TC_INTENSET_SYNCRDY_Msk                                                                                        \
        (_UINT8_(0x1) << TC_INTENSET_SYNCRDY_Pos) /* (TC_INTENSET) Synchronization Ready Interrupt Enable Mask */
#define TC_INTENSET_SYNCRDY(value)                                                                                     \
        (TC_INTENSET_SYNCRDY_Msk &                                                                                     \
         (_UINT8_(value) << TC_INTENSET_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the TC_INTENSET register */
#define TC_INTENSET_MC0_Pos _UINT8_(4) /* (TC_INTENSET) Match or Capture Channel 0 Interrupt Enable Position */
#define TC_INTENSET_MC0_Msk                                                                                            \
        (_UINT8_(0x1) << TC_INTENSET_MC0_Pos) /* (TC_INTENSET) Match or Capture Channel 0 Interrupt Enable Mask */
#define TC_INTENSET_MC0(value)                                                                                         \
        (TC_INTENSET_MC0_Msk &                                                                                         \
         (_UINT8_(value) << TC_INTENSET_MC0_Pos)) /* Assigment of value for MC0 in the TC_INTENSET register */
#define TC_INTENSET_MC1_Pos _UINT8_(5) /* (TC_INTENSET) Match or Capture Channel 1 Interrupt Enable Position */
#define TC_INTENSET_MC1_Msk                                                                                            \
        (_UINT8_(0x1) << TC_INTENSET_MC1_Pos) /* (TC_INTENSET) Match or Capture Channel 1 Interrupt Enable Mask */
#define TC_INTENSET_MC1(value)                                                                                         \
        (TC_INTENSET_MC1_Msk &                                                                                         \
         (_UINT8_(value) << TC_INTENSET_MC1_Pos)) /* Assigment of value for MC1 in the TC_INTENSET register */
#define TC_INTENSET_Msk _UINT8_(0x3B) /* (TC_INTENSET) Register Mask  */

#define TC_INTENSET_MC_Pos _UINT8_(4) /* (TC_INTENSET Position) Match or Capture Channel x Interrupt Enable */
#define TC_INTENSET_MC_Msk (_UINT8_(0x3) << TC_INTENSET_MC_Pos) /* (TC_INTENSET Mask) MC */
#define TC_INTENSET_MC(value) (TC_INTENSET_MC_Msk & (_UINT8_(value) << TC_INTENSET_MC_Pos))

/* -------- TC_INTFLAG : (TC Offset: 0x0E) (R/W 8) Interrupt Flag Status and Clear -------- */
#define TC_INTFLAG_RESETVALUE _UINT8_(0x00) /*  (TC_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define TC_INTFLAG_OVF_Pos _UINT8_(0) /* (TC_INTFLAG) Overflow Position */
#define TC_INTFLAG_OVF_Msk (_UINT8_(0x1) << TC_INTFLAG_OVF_Pos) /* (TC_INTFLAG) Overflow Mask */
#define TC_INTFLAG_OVF(value)                                                                                          \
        (TC_INTFLAG_OVF_Msk &                                                                                          \
         (_UINT8_(value) << TC_INTFLAG_OVF_Pos)) /* Assigment of value for OVF in the TC_INTFLAG register */
#define TC_INTFLAG_ERR_Pos _UINT8_(1) /* (TC_INTFLAG) Error Position */
#define TC_INTFLAG_ERR_Msk (_UINT8_(0x1) << TC_INTFLAG_ERR_Pos) /* (TC_INTFLAG) Error Mask */
#define TC_INTFLAG_ERR(value)                                                                                          \
        (TC_INTFLAG_ERR_Msk &                                                                                          \
         (_UINT8_(value) << TC_INTFLAG_ERR_Pos)) /* Assigment of value for ERR in the TC_INTFLAG register */
#define TC_INTFLAG_SYNCRDY_Pos _UINT8_(3) /* (TC_INTFLAG) Synchronization Ready Position */
#define TC_INTFLAG_SYNCRDY_Msk (_UINT8_(0x1) << TC_INTFLAG_SYNCRDY_Pos) /* (TC_INTFLAG) Synchronization Ready Mask */
#define TC_INTFLAG_SYNCRDY(value)                                                                                      \
        (TC_INTFLAG_SYNCRDY_Msk &                                                                                      \
         (_UINT8_(value) << TC_INTFLAG_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the TC_INTFLAG register */
#define TC_INTFLAG_MC0_Pos _UINT8_(4) /* (TC_INTFLAG) Match or Capture Channel 0 Position */
#define TC_INTFLAG_MC0_Msk (_UINT8_(0x1) << TC_INTFLAG_MC0_Pos) /* (TC_INTFLAG) Match or Capture Channel 0 Mask */
#define TC_INTFLAG_MC0(value)                                                                                          \
        (TC_INTFLAG_MC0_Msk &                                                                                          \
         (_UINT8_(value) << TC_INTFLAG_MC0_Pos)) /* Assigment of value for MC0 in the TC_INTFLAG register */
#define TC_INTFLAG_MC1_Pos _UINT8_(5) /* (TC_INTFLAG) Match or Capture Channel 1 Position */
#define TC_INTFLAG_MC1_Msk (_UINT8_(0x1) << TC_INTFLAG_MC1_Pos) /* (TC_INTFLAG) Match or Capture Channel 1 Mask */
#define TC_INTFLAG_MC1(value)                                                                                          \
        (TC_INTFLAG_MC1_Msk &                                                                                          \
         (_UINT8_(value) << TC_INTFLAG_MC1_Pos)) /* Assigment of value for MC1 in the TC_INTFLAG register */
#define TC_INTFLAG_Msk _UINT8_(0x3B) /* (TC_INTFLAG) Register Mask  */

#define TC_INTFLAG_MC_Pos _UINT8_(4) /* (TC_INTFLAG Position) Match or Capture Channel x */
#define TC_INTFLAG_MC_Msk (_UINT8_(0x3) << TC_INTFLAG_MC_Pos) /* (TC_INTFLAG Mask) MC */
#define TC_INTFLAG_MC(value) (TC_INTFLAG_MC_Msk & (_UINT8_(value) << TC_INTFLAG_MC_Pos))

/* -------- TC_STATUS : (TC Offset: 0x0F) ( R/ 8) Status -------- */
#define TC_STATUS_RESETVALUE _UINT8_(0x08) /*  (TC_STATUS) Status  Reset Value */

#define TC_STATUS_STOP_Pos _UINT8_(3) /* (TC_STATUS) Stop Position */
#define TC_STATUS_STOP_Msk (_UINT8_(0x1) << TC_STATUS_STOP_Pos) /* (TC_STATUS) Stop Mask */
#define TC_STATUS_STOP(value)                                                                                          \
        (TC_STATUS_STOP_Msk &                                                                                          \
         (_UINT8_(value) << TC_STATUS_STOP_Pos)) /* Assigment of value for STOP in the TC_STATUS register */
#define TC_STATUS_SLAVE_Pos _UINT8_(4) /* (TC_STATUS) Slave Position */
#define TC_STATUS_SLAVE_Msk (_UINT8_(0x1) << TC_STATUS_SLAVE_Pos) /* (TC_STATUS) Slave Mask */
#define TC_STATUS_SLAVE(value)                                                                                         \
        (TC_STATUS_SLAVE_Msk &                                                                                         \
         (_UINT8_(value) << TC_STATUS_SLAVE_Pos)) /* Assigment of value for SLAVE in the TC_STATUS register */
#define TC_STATUS_SYNCBUSY_Pos _UINT8_(7) /* (TC_STATUS) Synchronization Busy Position */
#define TC_STATUS_SYNCBUSY_Msk (_UINT8_(0x1) << TC_STATUS_SYNCBUSY_Pos) /* (TC_STATUS) Synchronization Busy Mask */
#define TC_STATUS_SYNCBUSY(value)                                                                                      \
        (TC_STATUS_SYNCBUSY_Msk &                                                                                      \
         (_UINT8_(value) << TC_STATUS_SYNCBUSY_Pos)) /* Assigment of value for SYNCBUSY in the TC_STATUS register */
#define TC_STATUS_Msk _UINT8_(0x98) /* (TC_STATUS) Register Mask  */


/* -------- TC_COUNT8_COUNT : (TC Offset: 0x10) (R/W 8) COUNT8 Counter Value -------- */
#define TC_COUNT8_COUNT_RESETVALUE _UINT8_(0x00) /*  (TC_COUNT8_COUNT) COUNT8 Counter Value  Reset Value */

#define TC_COUNT8_COUNT_COUNT_Pos _UINT8_(0) /* (TC_COUNT8_COUNT) Counter Value Position */
#define TC_COUNT8_COUNT_COUNT_Msk                                                                                      \
        (_UINT8_(0xFF) << TC_COUNT8_COUNT_COUNT_Pos) /* (TC_COUNT8_COUNT) Counter Value Mask */
#define TC_COUNT8_COUNT_COUNT(value)                                                                                   \
        (TC_COUNT8_COUNT_COUNT_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << TC_COUNT8_COUNT_COUNT_Pos)) /* Assigment of value for COUNT in the TC_COUNT8_COUNT register */
#define TC_COUNT8_COUNT_Msk _UINT8_(0xFF) /* (TC_COUNT8_COUNT) Register Mask  */


/* -------- TC_COUNT16_COUNT : (TC Offset: 0x10) (R/W 16) COUNT16 Counter Value -------- */
#define TC_COUNT16_COUNT_RESETVALUE _UINT16_(0x00) /*  (TC_COUNT16_COUNT) COUNT16 Counter Value  Reset Value */

#define TC_COUNT16_COUNT_COUNT_Pos _UINT16_(0) /* (TC_COUNT16_COUNT) Count Value Position */
#define TC_COUNT16_COUNT_COUNT_Msk                                                                                     \
        (_UINT16_(0xFFFF) << TC_COUNT16_COUNT_COUNT_Pos) /* (TC_COUNT16_COUNT) Count Value Mask */
#define TC_COUNT16_COUNT_COUNT(value)                                                                                  \
        (TC_COUNT16_COUNT_COUNT_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << TC_COUNT16_COUNT_COUNT_Pos)) /* Assigment of value for COUNT in the TC_COUNT16_COUNT register */
#define TC_COUNT16_COUNT_Msk _UINT16_(0xFFFF) /* (TC_COUNT16_COUNT) Register Mask  */


