ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tc.h
/* -------- TC_COUNT32_COUNT : (TC Offset: 0x10) (R/W 32) COUNT32 Counter Value -------- */
#define TC_COUNT32_COUNT_RESETVALUE _UINT32_(0x00) /*  (TC_COUNT32_COUNT) COUNT32 Counter Value  Reset Value */

#define TC_COUNT32_COUNT_COUNT_Pos _UINT32_(0) /* (TC_COUNT32_COUNT) Count Value Position */
#define TC_COUNT32_COUNT_COUNT_Msk                                                                                     \
        (_UINT32_(0xFFFFFFFF) << TC_COUNT32_COUNT_COUNT_Pos) /* (TC_COUNT32_COUNT) Count Value Mask */
#define TC_COUNT32_COUNT_COUNT(value)                                                                                  \
        (TC_COUNT32_COUNT_COUNT_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << TC_COUNT32_COUNT_COUNT_Pos)) /* Assigment of value for COUNT in the TC_COUNT32_COUNT register */
#define TC_COUNT32_COUNT_Msk _UINT32_(0xFFFFFFFF) /* (TC_COUNT32_COUNT) Register Mask  */


/* -------- TC_COUNT8_PER : (TC Offset: 0x14) (R/W 8) COUNT8 Period Value -------- */
#define TC_COUNT8_PER_RESETVALUE _UINT8_(0xFF) /*  (TC_COUNT8_PER) COUNT8 Period Value  Reset Value */

#define TC_COUNT8_PER_PER_Pos _UINT8_(0) /* (TC_COUNT8_PER) Period Value Position */
#define TC_COUNT8_PER_PER_Msk (_UINT8_(0xFF) << TC_COUNT8_PER_PER_Pos) /* (TC_COUNT8_PER) Period Value Mask */
#define TC_COUNT8_PER_PER(value)                                                                                       \
        (TC_COUNT8_PER_PER_Msk &                                                                                       \
         (_UINT8_(value) << TC_COUNT8_PER_PER_Pos)) /* Assigment of value for PER in the TC_COUNT8_PER register */
#define TC_COUNT8_PER_Msk _UINT8_(0xFF) /* (TC_COUNT8_PER) Register Mask  */


/* -------- TC_COUNT8_CC : (TC Offset: 0x18) (R/W 8) COUNT8 Compare/Capture -------- */
#define TC_COUNT8_CC_RESETVALUE _UINT8_(0x00) /*  (TC_COUNT8_CC) COUNT8 Compare/Capture  Reset Value */

#define TC_COUNT8_CC_CC_Pos _UINT8_(0) /* (TC_COUNT8_CC) Compare/Capture Value Position */
#define TC_COUNT8_CC_CC_Msk (_UINT8_(0xFF) << TC_COUNT8_CC_CC_Pos) /* (TC_COUNT8_CC) Compare/Capture Value Mask */
#define TC_COUNT8_CC_CC(value)                                                                                         \
        (TC_COUNT8_CC_CC_Msk &                                                                                         \
         (_UINT8_(value) << TC_COUNT8_CC_CC_Pos)) /* Assigment of value for CC in the TC_COUNT8_CC register */
#define TC_COUNT8_CC_Msk _UINT8_(0xFF) /* (TC_COUNT8_CC) Register Mask  */


/* -------- TC_COUNT16_CC : (TC Offset: 0x18) (R/W 16) COUNT16 Compare/Capture -------- */
#define TC_COUNT16_CC_RESETVALUE _UINT16_(0x00) /*  (TC_COUNT16_CC) COUNT16 Compare/Capture  Reset Value */

#define TC_COUNT16_CC_CC_Pos _UINT16_(0) /* (TC_COUNT16_CC) Compare/Capture Value Position */
#define TC_COUNT16_CC_CC_Msk (_UINT16_(0xFFFF) << TC_COUNT16_CC_CC_Pos) /* (TC_COUNT16_CC) Compare/Capture Value Mask  \
                                                                         */
#define TC_COUNT16_CC_CC(value)                                                                                        \
        (TC_COUNT16_CC_CC_Msk &                                                                                        \
         (_UINT16_(value) << TC_COUNT16_CC_CC_Pos)) /* Assigment of value for CC in the TC_COUNT16_CC register */
#define TC_COUNT16_CC_Msk _UINT16_(0xFFFF) /* (TC_COUNT16_CC) Register Mask  */


/* -------- TC_COUNT32_CC : (TC Offset: 0x18) (R/W 32) COUNT32 Compare/Capture -------- */
#define TC_COUNT32_CC_RESETVALUE _UINT32_(0x00) /*  (TC_COUNT32_CC) COUNT32 Compare/Capture  Reset Value */

#define TC_COUNT32_CC_CC_Pos _UINT32_(0) /* (TC_COUNT32_CC) Compare/Capture Value Position */
#define TC_COUNT32_CC_CC_Msk                                                                                           \
        (_UINT32_(0xFFFFFFFF) << TC_COUNT32_CC_CC_Pos) /* (TC_COUNT32_CC) Compare/Capture Value Mask */
#define TC_COUNT32_CC_CC(value)                                                                                        \
        (TC_COUNT32_CC_CC_Msk &                                                                                        \
         (_UINT32_(value) << TC_COUNT32_CC_CC_Pos)) /* Assigment of value for CC in the TC_COUNT32_CC register */
#define TC_COUNT32_CC_Msk _UINT32_(0xFFFFFFFF) /* (TC_COUNT32_CC) Register Mask  */


/** \brief TC register offsets definitions */
#define TC_CTRLA_REG_OFST _UINT32_(0x00) /* (TC_CTRLA) Control A Offset */
#define TC_READREQ_REG_OFST _UINT32_(0x02) /* (TC_READREQ) Read Request Offset */
#define TC_CTRLBCLR_REG_OFST _UINT32_(0x04) /* (TC_CTRLBCLR) Control B Clear Offset */
#define TC_CTRLBSET_REG_OFST _UINT32_(0x05) /* (TC_CTRLBSET) Control B Set Offset */
#define TC_CTRLC_REG_OFST _UINT32_(0x06) /* (TC_CTRLC) Control C Offset */
#define TC_DBGCTRL_REG_OFST _UINT32_(0x08) /* (TC_DBGCTRL) Debug Control Offset */
#define TC_EVCTRL_REG_OFST _UINT32_(0x0A) /* (TC_EVCTRL) Event Control Offset */
#define TC_INTENCLR_REG_OFST _UINT32_(0x0C) /* (TC_INTENCLR) Interrupt Enable Clear Offset */
#define TC_INTENSET_REG_OFST _UINT32_(0x0D) /* (TC_INTENSET) Interrupt Enable Set Offset */
#define TC_INTFLAG_REG_OFST _UINT32_(0x0E) /* (TC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define TC_STATUS_REG_OFST _UINT32_(0x0F) /* (TC_STATUS) Status Offset */
#define TC_COUNT8_COUNT_REG_OFST _UINT32_(0x10) /* (TC_COUNT8_COUNT) COUNT8 Counter Value Offset */
#define TC_COUNT16_COUNT_REG_OFST _UINT32_(0x10) /* (TC_COUNT16_COUNT) COUNT16 Counter Value Offset */
#define TC_COUNT32_COUNT_REG_OFST _UINT32_(0x10) /* (TC_COUNT32_COUNT) COUNT32 Counter Value Offset */
#define TC_COUNT8_PER_REG_OFST _UINT32_(0x14) /* (TC_COUNT8_PER) COUNT8 Period Value Offset */
#define TC_COUNT8_CC_REG_OFST _UINT32_(0x18) /* (TC_COUNT8_CC) COUNT8 Compare/Capture Offset */
#define TC_COUNT8_CC0_REG_OFST _UINT32_(0x18) /* (TC_COUNT8_CC0) COUNT8 Compare/Capture Offset */
#define TC_COUNT8_CC1_REG_OFST _UINT32_(0x19) /* (TC_COUNT8_CC1) COUNT8 Compare/Capture Offset */
#define TC_COUNT16_CC_REG_OFST _UINT32_(0x18) /* (TC_COUNT16_CC) COUNT16 Compare/Capture Offset */
#define TC_COUNT16_CC0_REG_OFST _UINT32_(0x18) /* (TC_COUNT16_CC0) COUNT16 Compare/Capture Offset */
#define TC_COUNT16_CC1_REG_OFST _UINT32_(0x1A) /* (TC_COUNT16_CC1) COUNT16 Compare/Capture Offset */
#define TC_COUNT32_CC_REG_OFST _UINT32_(0x18) /* (TC_COUNT32_CC) COUNT32 Compare/Capture Offset */
#define TC_COUNT32_CC0_REG_OFST _UINT32_(0x18) /* (TC_COUNT32_CC0) COUNT32 Compare/Capture Offset */
#define TC_COUNT32_CC1_REG_OFST _UINT32_(0x1C) /* (TC_COUNT32_CC1) COUNT32 Compare/Capture Offset */

