ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief TC register API structure */
typedef struct { /* Basic Timer Counter */
        __IO uint16_t TC_CTRLA; /**< Offset: 0x00 (R/W  16) Control A */
        __IO uint16_t TC_READREQ; /**< Offset: 0x02 (R/W  16) Read Request */
        __IO uint8_t TC_CTRLBCLR; /**< Offset: 0x04 (R/W  8) Control B Clear */
        __IO uint8_t TC_CTRLBSET; /**< Offset: 0x05 (R/W  8) Control B Set */
        __IO uint8_t TC_CTRLC; /**< Offset: 0x06 (R/W  8) Control C */
        __I uint8_t Reserved1[0x01];
        __IO uint8_t TC_DBGCTRL; /**< Offset: 0x08 (R/W  8) Debug Control */
        __I uint8_t Reserved2[0x01];
        __IO uint16_t TC_EVCTRL; /**< Offset: 0x0A (R/W  16) Event Control */
        __IO uint8_t TC_INTENCLR; /**< Offset: 0x0C (R/W  8) Interrupt Enable Clear */
        __IO uint8_t TC_INTENSET; /**< Offset: 0x0D (R/W  8) Interrupt Enable Set */
        __IO uint8_t TC_INTFLAG; /**< Offset: 0x0E (R/W  8) Interrupt Flag Status and Clear */
        __I uint8_t TC_STATUS; /**< Offset: 0x0F (R/   8) Status */
        __IO uint8_t TC_COUNT; /**< Offset: 0x10 (R/W  8) COUNT8 Counter Value */
        __I uint8_t Reserved3[0x03];
        __IO uint8_t TC_PER; /**< Offset: 0x14 (R/W  8) COUNT8 Period Value */
        __I uint8_t Reserved4[0x03];
        __IO uint8_t TC_CC[2]; /**< Offset: 0x18 (R/W  8) COUNT8 Compare/Capture */
} tc_count8_registers_t;

/** \brief TC register API structure */
typedef struct { /* Basic Timer Counter */
        __IO uint16_t TC_CTRLA; /**< Offset: 0x00 (R/W  16) Control A */
        __IO uint16_t TC_READREQ; /**< Offset: 0x02 (R/W  16) Read Request */
        __IO uint8_t TC_CTRLBCLR; /**< Offset: 0x04 (R/W  8) Control B Clear */
        __IO uint8_t TC_CTRLBSET; /**< Offset: 0x05 (R/W  8) Control B Set */
        __IO uint8_t TC_CTRLC; /**< Offset: 0x06 (R/W  8) Control C */
        __I uint8_t Reserved1[0x01];
        __IO uint8_t TC_DBGCTRL; /**< Offset: 0x08 (R/W  8) Debug Control */
        __I uint8_t Reserved2[0x01];
        __IO uint16_t TC_EVCTRL; /**< Offset: 0x0A (R/W  16) Event Control */
        __IO uint8_t TC_INTENCLR; /**< Offset: 0x0C (R/W  8) Interrupt Enable Clear */
        __IO uint8_t TC_INTENSET; /**< Offset: 0x0D (R/W  8) Interrupt Enable Set */
        __IO uint8_t TC_INTFLAG; /**< Offset: 0x0E (R/W  8) Interrupt Flag Status and Clear */
        __I uint8_t TC_STATUS; /**< Offset: 0x0F (R/   8) Status */
        __IO uint16_t TC_COUNT; /**< Offset: 0x10 (R/W  16) COUNT16 Counter Value */
        __I uint8_t Reserved3[0x06];
        __IO uint16_t TC_CC[2]; /**< Offset: 0x18 (R/W  16) COUNT16 Compare/Capture */
} tc_count16_registers_t;

/** \brief TC register API structure */
typedef struct { /* Basic Timer Counter */
        __IO uint16_t TC_CTRLA; /**< Offset: 0x00 (R/W  16) Control A */
        __IO uint16_t TC_READREQ; /**< Offset: 0x02 (R/W  16) Read Request */
        __IO uint8_t TC_CTRLBCLR; /**< Offset: 0x04 (R/W  8) Control B Clear */
        __IO uint8_t TC_CTRLBSET; /**< Offset: 0x05 (R/W  8) Control B Set */
        __IO uint8_t TC_CTRLC; /**< Offset: 0x06 (R/W  8) Control C */
        __I uint8_t Reserved1[0x01];
        __IO uint8_t TC_DBGCTRL; /**< Offset: 0x08 (R/W  8) Debug Control */
        __I uint8_t Reserved2[0x01];
        __IO uint16_t TC_EVCTRL; /**< Offset: 0x0A (R/W  16) Event Control */
        __IO uint8_t TC_INTENCLR; /**< Offset: 0x0C (R/W  8) Interrupt Enable Clear */
        __IO uint8_t TC_INTENSET; /**< Offset: 0x0D (R/W  8) Interrupt Enable Set */
        __IO uint8_t TC_INTFLAG; /**< Offset: 0x0E (R/W  8) Interrupt Flag Status and Clear */
        __I uint8_t TC_STATUS; /**< Offset: 0x0F (R/   8) Status */
        __IO uint32_t TC_COUNT; /**< Offset: 0x10 (R/W  32) COUNT32 Counter Value */
        __I uint8_t Reserved3[0x04];
        __IO uint32_t TC_CC[2]; /**< Offset: 0x18 (R/W  32) COUNT32 Compare/Capture */
} tc_count32_registers_t;

/** \brief TC hardware registers */
typedef union { /* Basic Timer Counter */
        tc_count8_registers_t COUNT8; /**< 8-bit Counter Mode */
        tc_count16_registers_t COUNT16; /**< 16-bit Counter Mode */
        tc_count32_registers_t COUNT32; /**< 32-bit Counter Mode */
} tc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_TC_COMPONENT_H_ */
